tests/Unit/Api/Invoices/data/responses/invoice_created.json

{
  "invoice": {
    "id": "43",
    "customer_id": "8avVGOkx8U1MX",
    "recurring": false,
    "status": "paid",
    "price_type": "tax_exclusive",
    "date": 1506418688,
    "due_date": 1506418688,
    "net_term_days": 0,
    "exchange_rate": 1.0,
    "total": 1000,
    "amount_paid": 400,
    "amount_adjusted": 0,
    "write_off_amount": 0,
    "credits_applied": 600,
    "amount_due": 0,
    "paid_at": 1506418689,
    "updated_at": 1506418689,
    "resource_version": 1506418689000,
    "deleted": false,
    "object": "invoice",
    "first_invoice": true,
    "amount_to_collect": 0,
    "new_sales_amount": 1000,
    "has_advance_charges": false,
    "currency_code": "USD",
    "base_currency_code": "USD",
    "tax": 0,
    "line_items": [
      {
        "id": "li_3Nl8LlrQWK3Iaw48",
        "date_from": 1506418688,
        "date_to": 1506418688,
        "unit_amount": 1000,
        "quantity": 1,
        "is_taxed": false,
        "tax_amount": 0,
        "object": "line_item",
        "amount": 1000,
        "description": "Support charge",
        "entity_type": "adhoc",
        "tax_exempt_reason": "tax_not_configured",
        "discount_amount": 0,
        "item_level_discount_amount": 0
      }
    ],
    "sub_total": 1000,
    "linked_payments": [
      {
        "txn_id": "txn_3Nl8LlrQWK3Ifj4B",
        "applied_amount": 400,
        "applied_at": 1506418689,
        "txn_status": "success",
        "txn_date": 1506418689,
        "txn_amount": 400
      }
    ],
    "applied_credits": [
      {
        "applied_amount": 100,
        "applied_at": 1506418689,
        "cn_id": "TEST-CN-1",
        "cn_reason_code": "waiver",
        "cn_date": 1506418552,
        "cn_status": "refunded"
      }
    ],
    "adjustment_credit_notes": [],
    "issued_credit_notes": [],
    "linked_orders": [],
    "billing_address": {
      "first_name": "Benjamin",
      "last_name": "Ross",
      "validation_status": "not_validated",
      "object": "billing_address"
    }
  }
}