tests/Unit/Api/Invoices/data/responses/invoice_created_for_addon.json

{
  "invoice": {
    "id": "45",
    "customer_id": "8avVGOkx8U1MX",
    "subscription_id": "8avVGOkx8U1MX",
    "recurring": false,
    "status": "paid",
    "price_type": "tax_exclusive",
    "date": 1506418690,
    "due_date": 1506418690,
    "net_term_days": 0,
    "exchange_rate": 1.0,
    "total": 495,
    "amount_paid": 495,
    "amount_adjusted": 0,
    "write_off_amount": 0,
    "credits_applied": 0,
    "amount_due": 0,
    "paid_at": 1506418690,
    "updated_at": 1506418690,
    "resource_version": 1506418690000,
    "deleted": false,
    "object": "invoice",
    "first_invoice": false,
    "amount_to_collect": 0,
    "has_advance_charges": false,
    "currency_code": "USD",
    "base_currency_code": "USD",
    "tax": 0,
    "line_items": [
      {
        "id": "li_3Nl8LlrQWK3J1V4P",
        "date_from": 1506418690,
        "date_to": 1506418690,
        "unit_amount": 495,
        "quantity": 1,
        "is_taxed": false,
        "tax_amount": 0,
        "object": "line_item",
        "subscription_id": "8avVGOkx8U1MX",
        "amount": 495,
        "description": "Support Charge",
        "entity_type": "addon",
        "entity_id": "support_charge",
        "tax_exempt_reason": "tax_not_configured",
        "discount_amount": 0,
        "item_level_discount_amount": 0
      }
    ],
    "sub_total": 495,
    "linked_payments": [
      {
        "txn_id": "txn_3Nl8LlrQWK3J4k4Q",
        "applied_amount": 495,
        "applied_at": 1506418690,
        "txn_status": "success",
        "txn_date": 1506418690,
        "txn_amount": 495
      }
    ],
    "applied_credits": [],
    "adjustment_credit_notes": [],
    "issued_credit_notes": [],
    "linked_orders": [],
    "billing_address": {
      "first_name": "Benjamin",
      "last_name": "Ross",
      "validation_status": "not_validated",
      "object": "billing_address"
    },
    "shipping_address": {
      "first_name": "Benjamin",
      "last_name": "Ross",
      "line1": "PO Box 9999",
      "city": "Walnut",
      "state_code": "CA",
      "state": "California",
      "country": "US",
      "zip": "91789",
      "validation_status": "not_validated",
      "object": "shipping_address"
    }
  }
}