tests/Unit/Api/Invoices/data/responses/invoice_credit_note_removed.json

{
  "credit_note": {
    "allocations": [],
    "amount_allocated": 0,
    "amount_available": 1000,
    "amount_refunded": 0,
    "base_currency_code": "USD",
    "currency_code": "USD",
    "customer_id": "monthly_super_saver",
    "date": 1506418603,
    "deleted": false,
    "exchange_rate": 1,
    "id": "TEST-CN-2",
    "line_item_discounts": [],
    "line_item_taxes": [],
    "line_items": [
      {
        "amount": 1000,
        "date_from": 1506418603,
        "date_to": 1506418603,
        "description": "No Trial",
        "discount_amount": 0,
        "entity_id": "no_trial",
        "entity_type": "plan",
        "id": "li_3Nl8LlrQWK2wEX1R",
        "is_taxed": false,
        "item_level_discount_amount": 0,
        "object": "line_item",
        "quantity": 1,
        "subscription_id": "monthly_super_saver",
        "tax_amount": 0,
        "tax_exempt_reason": "tax_not_configured",
        "unit_amount": 1000
      }
    ],
    "linked_refunds": [],
    "object": "credit_note",
    "price_type": "tax_exclusive",
    "reason_code": "product_unsatisfactory",
    "reference_invoice_id": "38",
    "refunded_at": 1506418603,
    "resource_version": 1506418603000,
    "status": "voided",
    "sub_total": 1000,
    "subscription_id": "monthly_super_saver",
    "taxes": [],
    "total": 1000,
    "type": "adjustment",
    "updated_at": 1506418603,
    "voided_at": 1506418603
  },
  "invoice": {
    "adjustment_credit_notes": [
      {
        "cn_date": 1506418603,
        "cn_id": "TEST-CN-2",
        "cn_reason_code": "product_unsatisfactory",
        "cn_status": "voided",
        "cn_total": 1000
      }
    ],
    "amount_adjusted": 0,
    "amount_due": 1000,
    "amount_paid": 0,
    "amount_to_collect": 1000,
    "applied_credits": [],
    "base_currency_code": "USD",
    "billing_address": {
      "first_name": "Rudolf",
      "last_name": "Bob",
      "object": "billing_address",
      "validation_status": "not_validated"
    },
    "credits_applied": 0,
    "currency_code": "USD",
    "customer_id": "monthly_super_saver",
    "date": 1506418602,
    "deleted": false,
    "due_date": 1506418602,
    "exchange_rate": 1,
    "first_invoice": true,
    "has_advance_charges": false,
    "id": "38",
    "issued_credit_notes": [],
    "line_items": [
      {
        "amount": 1000,
        "date_from": 1506418602,
        "date_to": 1509010602,
        "description": "No Trial",
        "discount_amount": 0,
        "entity_id": "no_trial",
        "entity_type": "plan",
        "id": "li_3Nl8LlrQWK2w2P1C",
        "is_taxed": false,
        "item_level_discount_amount": 0,
        "object": "line_item",
        "quantity": 1,
        "subscription_id": "monthly_super_saver",
        "tax_amount": 0,
        "tax_exempt_reason": "tax_not_configured",
        "unit_amount": 1000
      }
    ],
    "linked_orders": [],
    "linked_payments": [],
    "net_term_days": 0,
    "new_sales_amount": 1000,
    "object": "invoice",
    "price_type": "tax_exclusive",
    "recurring": true,
    "resource_version": 1506418603000,
    "status": "not_paid",
    "sub_total": 1000,
    "subscription_id": "monthly_super_saver",
    "tax": 0,
    "total": 1000,
    "updated_at": 1506418603,
    "write_off_amount": 0
  }
}