tests/Unit/Api/Invoices/data/responses/invoice_imported.json

{
  "invoice": {
    "id": "old_inv_001",
    "customer_id": "8avVGOkx8U1MX",
    "subscription_id": "8avVGOkx8U1MX",
    "recurring": true,
    "status": "payment_due",
    "price_type": "tax_exclusive",
    "date": 1394532759,
    "due_date": 1394532759,
    "net_term_days": 0,
    "exchange_rate": 1.0,
    "total": 4900,
    "amount_paid": 0,
    "amount_adjusted": 0,
    "write_off_amount": 0,
    "credits_applied": 0,
    "amount_due": 4900,
    "updated_at": 1506418736,
    "resource_version": 1506418736000,
    "deleted": false,
    "object": "invoice",
    "first_invoice": true,
    "amount_to_collect": 4900,
    "new_sales_amount": 4900,
    "has_advance_charges": false,
    "currency_code": "USD",
    "base_currency_code": "USD",
    "tax": 0,
    "line_items": [
      {
        "id": "li_3Nl8LlrQWK3UyG4V",
        "date_from": 1394532759,
        "date_to": 1396832759,
        "unit_amount": 4900,
        "quantity": 1,
        "is_taxed": false,
        "tax_amount": 0,
        "object": "line_item",
        "subscription_id": "8avVGOkx8U1MX",
        "amount": 4900,
        "description": "Support Charge",
        "entity_type": "plan",
        "entity_id": "basic",
        "tax_exempt_reason": "tax_not_configured",
        "discount_amount": 0,
        "item_level_discount_amount": 0
      }
    ],
    "sub_total": 4900,
    "linked_payments": [],
    "applied_credits": [],
    "adjustment_credit_notes": [],
    "issued_credit_notes": [],
    "linked_orders": [],
    "billing_address": {
      "first_name": "John",
      "last_name": "Doe",
      "line1": "PO Box 9999",
      "city": "Walnut",
      "state": "California",
      "country": "US",
      "zip": "91789",
      "validation_status": "not_validated",
      "object": "billing_address"
    }
  }
}