tests/Unit/Api/Invoices/data/responses/invoice_payment_collected.json

{
  "invoice": {
    "id": "58",
    "customer_id": "3Nl8LcOQWK3aZOAK",
    "subscription_id": "3Nl8LcOQWK3aZOAK",
    "recurring": true,
    "status": "paid",
    "price_type": "tax_exclusive",
    "date": 1506166758,
    "due_date": 1506166758,
    "net_term_days": 0,
    "exchange_rate": 1.0,
    "total": 1000,
    "amount_paid": 1000,
    "amount_adjusted": 0,
    "write_off_amount": 0,
    "credits_applied": 0,
    "amount_due": 0,
    "paid_at": 1506418778,
    "dunning_status": "stopped",
    "updated_at": 1506418778,
    "resource_version": 1506418778000,
    "deleted": false,
    "object": "invoice",
    "first_invoice": false,
    "amount_to_collect": 0,
    "has_advance_charges": false,
    "currency_code": "USD",
    "base_currency_code": "USD",
    "tax": 0,
    "line_items": [
      {
        "id": "li_3Nl8LcOQWK3dJ9B1",
        "date_from": 1506166758,
        "date_to": 1508758758,
        "unit_amount": 1000,
        "quantity": 1,
        "is_taxed": false,
        "tax_amount": 0,
        "object": "line_item",
        "subscription_id": "3Nl8LcOQWK3aZOAK",
        "amount": 1000,
        "description": "No Trial",
        "entity_type": "plan",
        "entity_id": "no_trial",
        "tax_exempt_reason": "tax_not_configured",
        "discount_amount": 0,
        "item_level_discount_amount": 0
      }
    ],
    "sub_total": 1000,
    "linked_payments": [
      {
        "txn_id": "txn_3Nl8LcOQWK3dKPB2",
        "applied_amount": 1000,
        "applied_at": 1506166759,
        "txn_status": "failure",
        "txn_date": 1506166759,
        "txn_amount": 1000
      }
    ],
    "applied_credits": [],
    "adjustment_credit_notes": [],
    "issued_credit_notes": [],
    "linked_orders": [],
    "billing_address": {
      "first_name": "Rachel",
      "last_name": "Green",
      "validation_status": "not_validated",
      "object": "billing_address"
    }
  },
  "transaction": {
    "id": "txn_3Nl8LlrQWK3frb5h",
    "customer_id": "3Nl8LcOQWK3aZOAK",
    "subscription_id": "3Nl8LcOQWK3aZOAK",
    "gateway_account_id": "gw_3Nl8LcOQWK2N9I2",
    "payment_source_id": "pm_3Nl8LcOQWK3fo9Bk",
    "payment_method": "card",
    "gateway": "chargebee",
    "type": "payment",
    "date": 1506418778,
    "exchange_rate": 1.0,
    "amount": 1000,
    "id_at_gateway": "cb_3Nl8LlrQWK3frn5i",
    "status": "success",
    "updated_at": 1506418778,
    "resource_version": 1506418778000,
    "deleted": false,
    "object": "transaction",
    "masked_card_number": "************1111",
    "currency_code": "USD",
    "base_currency_code": "USD",
    "amount_unused": 0,
    "linked_invoices": [
      {
        "invoice_id": "58",
        "applied_amount": 1000,
        "applied_at": 1506418778,
        "invoice_date": 1506166758,
        "invoice_total": 1000,
        "invoice_status": "paid"
      }
    ],
    "linked_refunds": []
  }
}