tests/Unit/Api/Invoices/data/responses/invoice_payments_applied.json

{
  "invoice": {
    "id": "48",
    "customer_id": "3Nl8LcOQWK3V0f9W",
    "subscription_id": "3Nl8LcOQWK3V0f9W",
    "recurring": true,
    "status": "paid",
    "price_type": "tax_exclusive",
    "date": 1506418736,
    "due_date": 1506418736,
    "net_term_days": 0,
    "exchange_rate": 1.0,
    "total": 1000,
    "amount_paid": 1000,
    "amount_adjusted": 0,
    "write_off_amount": 0,
    "credits_applied": 0,
    "amount_due": 0,
    "paid_at": 1506418737,
    "updated_at": 1506418737,
    "resource_version": 1506418737000,
    "deleted": false,
    "object": "invoice",
    "first_invoice": true,
    "amount_to_collect": 0,
    "new_sales_amount": 1000,
    "has_advance_charges": false,
    "currency_code": "USD",
    "base_currency_code": "USD",
    "tax": 0,
    "line_items": [
      {
        "id": "li_3Nl8LlrQWK3V344a",
        "date_from": 1506418736,
        "date_to": 1509010736,
        "unit_amount": 1000,
        "quantity": 1,
        "is_taxed": false,
        "tax_amount": 0,
        "object": "line_item",
        "subscription_id": "3Nl8LcOQWK3V0f9W",
        "amount": 1000,
        "description": "No Trial",
        "entity_type": "plan",
        "entity_id": "no_trial",
        "tax_exempt_reason": "tax_not_configured",
        "discount_amount": 0,
        "item_level_discount_amount": 0
      }
    ],
    "sub_total": 1000,
    "linked_payments": [
      {
        "txn_id": "txn_3Nl8LlrQWK3V4N4b",
        "applied_amount": 1000,
        "applied_at": 1506418737,
        "txn_status": "success",
        "txn_date": 1506418736,
        "txn_amount": 1000
      }
    ],
    "applied_credits": [],
    "adjustment_credit_notes": [],
    "issued_credit_notes": [],
    "linked_orders": [],
    "billing_address": {
      "first_name": "Rudolf",
      "last_name": "Bob",
      "validation_status": "not_validated",
      "object": "billing_address"
    }
  }
}