tests/Unit/Api/Invoices/data/responses/invoice_pending_charge_added.json

{
  "invoice": {
    "id": "52",
    "customer_id": "3Nl8LcOQWK3ZUW9e",
    "subscription_id": "3Nl8LcOQWK3ZUW9e",
    "recurring": true,
    "status": "pending",
    "price_type": "tax_exclusive",
    "date": 1506418754,
    "net_term_days": 0,
    "exchange_rate": 1.0,
    "total": 930,
    "amount_paid": 0,
    "amount_adjusted": 0,
    "write_off_amount": 0,
    "credits_applied": 0,
    "amount_due": 930,
    "updated_at": 1506418755,
    "resource_version": 1506418755000,
    "deleted": false,
    "object": "invoice",
    "first_invoice": false,
    "amount_to_collect": 930,
    "has_advance_charges": false,
    "currency_code": "USD",
    "base_currency_code": "USD",
    "tax": 0,
    "line_items": [
      {
        "id": "li_3Nl8LlrQWK3Zaj5D",
        "date_from": 1506418754,
        "date_to": 1508665153,
        "unit_amount": 780,
        "quantity": 1,
        "is_taxed": false,
        "tax_amount": 0,
        "object": "line_item",
        "subscription_id": "3Nl8LcOQWK3ZUW9e",
        "amount": 780,
        "description": "sample plan - Prorated Charges",
        "entity_type": "plan",
        "entity_id": "basic",
        "discount_amount": 0,
        "item_level_discount_amount": 0
      }
    ],
    "sub_total": 930,
    "linked_payments": [],
    "applied_credits": [],
    "adjustment_credit_notes": [],
    "issued_credit_notes": [],
    "linked_orders": []
  }
}