tests/Unit/Api/Invoices/data/responses/invoice_pending_closed.json

{
  "invoice": {
    "id": "56",
    "customer_id": "3Nl8LcOQWK3a8lA6",
    "subscription_id": "3Nl8LcOQWK3a8lA6",
    "recurring": true,
    "status": "paid",
    "price_type": "tax_exclusive",
    "date": 1506418757,
    "due_date": 1506418757,
    "net_term_days": 0,
    "exchange_rate": 1.0,
    "total": 780,
    "amount_paid": 0,
    "amount_adjusted": 0,
    "write_off_amount": 0,
    "credits_applied": 780,
    "amount_due": 0,
    "paid_at": 1506418757,
    "updated_at": 1506418757,
    "resource_version": 1506418757000,
    "deleted": false,
    "object": "invoice",
    "first_invoice": false,
    "amount_to_collect": 0,
    "has_advance_charges": false,
    "currency_code": "USD",
    "base_currency_code": "USD",
    "tax": 0,
    "line_items": [
      {
        "id": "li_3Nl8LlrQWK3aKu5V",
        "date_from": 1506418757,
        "date_to": 1508665156,
        "unit_amount": 780,
        "quantity": 1,
        "is_taxed": false,
        "tax_amount": 0,
        "object": "line_item",
        "subscription_id": "3Nl8LcOQWK3a8lA6",
        "amount": 780,
        "description": "sample plan - Prorated Charges",
        "entity_type": "plan",
        "entity_id": "basic",
        "tax_exempt_reason": "tax_not_configured",
        "discount_amount": 0,
        "item_level_discount_amount": 0
      }
    ],
    "sub_total": 780,
    "linked_payments": [],
    "applied_credits": [
      {
        "applied_amount": 780,
        "applied_at": 1506418757,
        "cn_id": "TEST-CN-10",
        "cn_reason_code": "subscription_change",
        "cn_date": 1506418757,
        "cn_status": "refund_due"
      }
    ],
    "adjustment_credit_notes": [],
    "issued_credit_notes": [],
    "linked_orders": [],
    "billing_address": {
      "first_name": "Rachel",
      "last_name": "Green",
      "validation_status": "not_validated",
      "object": "billing_address"
    }
  }
}