tests/Unit/Api/Invoices/data/responses/invoice_refunded.json

{
  "invoice": {
    "id": "1",
    "customer_id": "8avVGOkx8U1MX",
    "subscription_id": "8avVGOkx8U1MX",
    "recurring": true,
    "status": "paid",
    "price_type": "tax_exclusive",
    "date": 1414780245,
    "due_date": 1414780245,
    "net_term_days": 0,
    "exchange_rate": 1.0,
    "total": 900,
    "amount_paid": 900,
    "amount_adjusted": 0,
    "write_off_amount": 0,
    "credits_applied": 0,
    "amount_due": 0,
    "paid_at": 1414780246,
    "updated_at": 1506418785,
    "resource_version": 1506418785000,
    "deleted": false,
    "object": "invoice",
    "first_invoice": false,
    "amount_to_collect": 0,
    "has_advance_charges": false,
    "currency_code": "USD",
    "base_currency_code": "USD",
    "tax": 0,
    "line_items": [
      {
        "id": "li_3Nl8LcOQWK2SyEN",
        "date_from": 1414780245,
        "date_to": 1417372245,
        "unit_amount": 900,
        "quantity": 1,
        "is_taxed": false,
        "tax_amount": 0,
        "object": "line_item",
        "subscription_id": "8avVGOkx8U1MX",
        "amount": 900,
        "description": "Basic",
        "entity_type": "plan",
        "entity_id": "basic",
        "tax_exempt_reason": "tax_not_configured",
        "discount_amount": 0,
        "item_level_discount_amount": 0
      }
    ],
    "sub_total": 900,
    "linked_payments": [
      {
        "txn_id": "txn_3Nl8LcOQWK2T26O",
        "applied_amount": 900,
        "applied_at": 1414780246,
        "txn_status": "success",
        "txn_date": 1414780246,
        "txn_amount": 900
      }
    ],
    "applied_credits": [],
    "adjustment_credit_notes": [],
    "issued_credit_notes": [
      {
        "cn_id": "TEST-CN-1",
        "cn_reason_code": "waiver",
        "cn_date": 1506418552,
        "cn_total": 100,
        "cn_status": "refunded"
      }
    ],
    "linked_orders": [
      {
        "id": "XpbG8t4OvwWgjzM",
        "status": "processing",
        "reference_id": "1002",
        "fulfillment_status": "Awaiting Shipment",
        "created_at": 1506418525
      }
    ],
    "billing_address": {
      "first_name": "Benjamin",
      "last_name": "Ross",
      "validation_status": "not_validated",
      "object": "billing_address"
    }
  },
  "transaction": {
    "id": "txn_3Nl8LlrQWK3hYz5p",
    "customer_id": "8avVGOkx8U1MX",
    "subscription_id": "8avVGOkx8U1MX",
    "gateway_account_id": "gw_3Nl8LcOQWK2N9I2",
    "payment_source_id": "pm_3Nl8LcOQWK2Rkh6",
    "payment_method": "card",
    "gateway": "chargebee",
    "type": "refund",
    "date": 1506418785,
    "exchange_rate": 1.0,
    "amount": 200,
    "id_at_gateway": "cb_3Nl8LlrQWK3hZp5q",
    "status": "success",
    "updated_at": 1506418785,
    "resource_version": 1506418785000,
    "deleted": false,
    "object": "transaction",
    "masked_card_number": "************1111",
    "refunded_txn_id": "txn_3Nl8LcOQWK2T26O",
    "linked_credit_notes": [
      {
        "cn_id": "TEST-CN-11",
        "applied_amount": 200,
        "applied_at": 1506418785,
        "cn_reason_code": "other",
        "cn_date": 1506418785,
        "cn_total": 200,
        "cn_status": "refunded",
        "cn_reference_invoice_id": "1"
      }
    ],
    "currency_code": "USD",
    "base_currency_code": "USD"
  },
  "credit_note": {
    "id": "TEST-CN-11",
    "customer_id": "8avVGOkx8U1MX",
    "subscription_id": "8avVGOkx8U1MX",
    "reference_invoice_id": "1",
    "type": "refundable",
    "reason_code": "other",
    "status": "refunded",
    "date": 1506418785,
    "price_type": "tax_exclusive",
    "exchange_rate": 1.0,
    "total": 200,
    "amount_allocated": 0,
    "amount_refunded": 200,
    "amount_available": 0,
    "refunded_at": 1506418785,
    "updated_at": 1506418785,
    "resource_version": 1506418785000,
    "deleted": false,
    "object": "credit_note",
    "currency_code": "USD",
    "base_currency_code": "USD",
    "sub_total": 200,
    "line_items": [
      {
        "id": "li_3Nl8LlrQWK3hab5s",
        "date_from": 1506418785,
        "date_to": 1506418785,
        "unit_amount": 200,
        "quantity": 1,
        "is_taxed": false,
        "tax_amount": 0,
        "object": "line_item",
        "subscription_id": "8avVGOkx8U1MX",
        "amount": 200,
        "description": "Basic",
        "entity_type": "plan",
        "entity_id": "basic",
        "tax_exempt_reason": "tax_not_configured",
        "discount_amount": 0,
        "item_level_discount_amount": 0
      }
    ],
    "taxes": [],
    "line_item_taxes": [],
    "line_item_discounts": [],
    "linked_refunds": [
      {
        "applied_amount": 200,
        "applied_at": 1506418785,
        "txn_id": "txn_3Nl8LlrQWK3hYz5p",
        "txn_status": "success",
        "txn_date": 1506418785,
        "txn_amount": 200
      }
    ],
    "allocations": []
  }
}