tests/Unit/Api/Invoices/data/responses/invoice_written_off.json

{
  "invoice": {
    "id": "64",
    "customer_id": "3Nl8LcOQWK3i6ACj",
    "subscription_id": "3Nl8LcOQWK3i6ACj",
    "recurring": true,
    "status": "paid",
    "price_type": "tax_exclusive",
    "date": 1506166787,
    "due_date": 1506166787,
    "net_term_days": 0,
    "exchange_rate": 1.0,
    "total": 1000,
    "amount_paid": 0,
    "amount_adjusted": 1000,
    "write_off_amount": 1000,
    "credits_applied": 0,
    "amount_due": 0,
    "paid_at": 1506418794,
    "dunning_status": "stopped",
    "updated_at": 1506418794,
    "resource_version": 1506418794000,
    "deleted": false,
    "object": "invoice",
    "first_invoice": false,
    "amount_to_collect": 0,
    "has_advance_charges": false,
    "currency_code": "USD",
    "base_currency_code": "USD",
    "tax": 0,
    "line_items": [
      {
        "id": "li_3Nl8LcOQWK3jYGDE",
        "date_from": 1506166787,
        "date_to": 1508758787,
        "unit_amount": 1000,
        "quantity": 1,
        "is_taxed": false,
        "tax_amount": 0,
        "object": "line_item",
        "subscription_id": "3Nl8LcOQWK3i6ACj",
        "amount": 1000,
        "description": "No Trial",
        "entity_type": "plan",
        "entity_id": "no_trial",
        "tax_exempt_reason": "tax_not_configured",
        "discount_amount": 0,
        "item_level_discount_amount": 0
      }
    ],
    "sub_total": 1000,
    "linked_payments": [
      {
        "txn_id": "txn_3Nl8LcOQWK3jZ4DF",
        "applied_amount": 1000,
        "applied_at": 1506166788,
        "txn_status": "failure",
        "txn_date": 1506166788,
        "txn_amount": 1000
      }
    ],
    "applied_credits": [],
    "adjustment_credit_notes": [
      {
        "cn_id": "TEST-CN-14",
        "cn_reason_code": "write_off",
        "cn_date": 1506418794,
        "cn_total": 1000,
        "cn_status": "adjusted"
      }
    ],
    "issued_credit_notes": [],
    "linked_orders": [],
    "billing_address": {
      "first_name": "Rachel",
      "last_name": "Green",
      "validation_status": "not_validated",
      "object": "billing_address"
    }
  },
  "credit_note": {
    "id": "TEST-CN-14",
    "customer_id": "3Nl8LcOQWK3i6ACj",
    "subscription_id": "3Nl8LcOQWK3i6ACj",
    "reference_invoice_id": "64",
    "type": "adjustment",
    "reason_code": "write_off",
    "status": "adjusted",
    "date": 1506418794,
    "price_type": "tax_exclusive",
    "exchange_rate": 1.0,
    "total": 1000,
    "amount_allocated": 1000,
    "amount_refunded": 0,
    "amount_available": 0,
    "refunded_at": 1506418794,
    "updated_at": 1506418794,
    "resource_version": 1506418794000,
    "deleted": false,
    "object": "credit_note",
    "currency_code": "USD",
    "base_currency_code": "USD",
    "sub_total": 1000,
    "line_items": [
      {
        "id": "li_3Nl8LlrQWK3k276E",
        "date_from": 1506418794,
        "date_to": 1506418794,
        "unit_amount": 1000,
        "quantity": 1,
        "is_taxed": false,
        "tax_amount": 0,
        "object": "line_item",
        "subscription_id": "3Nl8LcOQWK3i6ACj",
        "amount": 1000,
        "description": "No Trial",
        "entity_type": "plan",
        "entity_id": "no_trial",
        "tax_exempt_reason": "tax_not_configured",
        "discount_amount": 0,
        "item_level_discount_amount": 0
      }
    ],
    "taxes": [],
    "line_item_taxes": [],
    "line_item_discounts": [],
    "linked_refunds": [],
    "allocations": [
      {
        "allocated_amount": 1000,
        "allocated_at": 1506418794,
        "invoice_id": "64",
        "invoice_date": 1506166787,
        "invoice_status": "paid"
      }
    ]
  }
}